#include<stdio.h>

//int main()
//{
//	int i = 0;
//	while (i < 10)
//	{
//		printf("%d ", i);
//		i = i + 1;
//	}
//
//	return 0;
//}

//int main()
//{
//	int a;
//	// 定义数组，不初始化，里面是随机值
//	int array1[10];
//
//	// 定义数组，初始化前5个，后面没给默认是0
//	int array2[10] = {1,2,3,4,5};
//	// 访问数组，array[0]-array[9]
//	array2[0] = 0;
//	array2[1] = 1;
//
//	//array2[10] = 10;
//	int i = 0;
//	while (i < 10)
//	{
//		printf("%d\n", array2[i]);
//		i = i + 1;
//	}
//
//
//	return 0;
//}

// 操作符
//int main()
//{
//	int a = 10, b = 3;
//	printf("%d\n", a + b);
//	printf("%d\n", a - b);
//	printf("%d\n", a * b);
//	printf("%d\n", a / b);
//	printf("%d\n", a % b);
//
//	float c = 10.0, d = 3.0;
//	// 默认小数点后6位
//	printf("%f\n", c / d);
//	// 保留两位的用法
//	printf("%.2f\n", c / d);
//
//	return 0;
//}

//int main()
//{
         // 高位丢掉，低位补0
//	//  00000000000000000000000000000001
//	//int a = 1;
//	//int ret = a << 1;
//	//printf("%d\n", ret);
//	//ret = ret << 1;
//	//printf("%d\n", ret);
//	//ret = ret << 1;
//	//printf("%d\n", ret);
//
//      // 低位丢掉，高位补0
//	//  00000000000000000000000000000011
//	int a = 3;
//	int ret = a >> 1;
//	printf("%d\n", ret);
//
//	return 0;
//}

//int main()
//{
//	// 
//	// &	^	|
//	int a = 3, b = 5;
//	// 按位与 & 只有1跟1与才是1，其他都是0
//	// a 00000000 00000000 00000000 00000011
//	// b 00000000 00000000 00000000 00000101
//	// --------------------------------------
//	//   00000000 00000000 00000000 00000001
//	printf("%d\n", a & b);
//
//	// 按位或 |  1跟其他数或都是1
//	// a 00000000 00000000 00000000 00000011
//	// b 00000000 00000000 00000000 00000101
//	// --------------------------------------
//	//   00000000 00000000 00000000 00000111
//	printf("%d\n", a | b);
//
//	// 按位异或 |  相异为1
//	// a 00000000 00000000 00000000 00000011
//	// b 00000000 00000000 00000000 00000101
//	// --------------------------------------
//	//   00000000 00000000 00000000 00000110
//	printf("%d\n", a ^ b);
//}

//int main()
//{
//	// 把某一位处理成0
//	// & | ^
//	//	00000000 00000000 00000000 00000011
//	// ^00000000 00000000 00000000 00000001
//	int i = 3;
//
//	printf("%d\n", i ^ 1);
//	printf("%d\n", i ^ 2);
//
//	i = i + 128;
//	//	00000000 00000000 00000000 10000011
//	// ^00000000 00000000 00000000 10000000
//	printf("%d\n", i ^ 1<<7);
//
//	// 把某一位处理成1
//	//	00000000 00000000 00000000 00000011
//	// |00000000 00000000 00000000 10000000
//	i = 3;
//	printf("%d\n", i | 1 << 7);
//
//	return 0;
//}

//int main()
//{
//	// 其他数都是成对出现的，只有一个数出现1次，请找出这个数
//	int a[5] = { 3, 1, 3, 2, 2 };
//	//	00000000 00000000 00000000 00000011
//	// ^00000000 00000000 00000000 00000001
//	//  00000000 00000000 00000000 00000010
//	// ^00000000 00000000 00000000 00000011
//	//  00000000 00000000 00000000 00000001
//	// ^00000000 00000000 00000000 00000010
//	//  00000000 00000000 00000000 00000011
//	// ^00000000 00000000 00000000 00000010
//	//  00000000 00000000 00000000 00000001
//	int i = 0;
//	int ret = 0;
//	while (i < 5)
//	{
//		ret = ret ^a[i];
//		//i = i + 1;
//		i += 1;
//	}
//
//	printf("%d\n", ret);
//
//	int x = 1;
//	x << 1;
//	x = x << 1;
//	// 等价于 
//	x <<= 1;
//
//	return 0;
//}

//int main()
//{
//	// 非0就是真  
//	// 0就是假
//	//if(condtion) 
//	//while (condtion)
//	//int a = 0;
//	//printf("%d\n", !a); // 取非以后如果为真，一般用1去代表真
//	//a = 1;
//	//a = 5;
//	//printf("%d\n", !a);
//
//	//int age;
//	//scanf("%d", &age);
//	////if (age < 18)
//	//if (!(age >= 18))
//	//{
//	//	printf("未成年人\n");
//	//}
//
//	int i = 1;
//	printf("%d\n", +i);
//	printf("%d\n", -i);
//
//	i = -1;
//	printf("%d\n", +i);
//	printf("%d\n", -i);
//
//	// 计算变量或者类型的大小
//	printf("%d\n", sizeof(i));
//	printf("%d\n", sizeof(int));
//
//	i = 1;
//	// 00000000000000000000000000000001
//	// 11111111111111111111111111111110
//	printf("%d\n", ~i);
//	// 十六进制
//	printf("%x\n", ~i);
//	printf("%X\n", ~i);
//
//	i = 1;
//	while (i < 10)
//	{
//		printf("%d\n", i);
//
//		//i += 1;
//		//++i;
//		i++;
//	}
//
//	i = 1;
//	// i先++，表达式返回值++以后i的值
//	int k = ++i;
//	printf("%d,%d\n", k, i);
//
//	i = 1;
//	// 表达式返回++之前i的值，i再++
//	int j = i++;
//	printf("%d,%d\n", j, i);
//
//	//int x = (int)3.14;
//	printf("%lf\n", 10 / (double)3);
//	
//	return 0;
//}

//int max(int x, int y)
//{
//	/*if (x > y)
//		return x;
//	else
//		return y;*/
//
//	return x > y ? x : y;
//}
//
//int main()
//{
//	// 18  30 青壮年
//	int age = 1;
//	// if (18 <= age <= 30) 不对
//	// 只支持一个一个条件写
//	if (age >= 18 && age <= 30)
//	{
//		printf("青壮年\n");
//	}
//
//	if (age < 7 || age > 70)
//	{
//		printf("免票\n");
//	}
//
//	// a+b 双目操作符
//	// !a  单目操作符
//	// x > y ? x : y;   三目操作符
//	int a = 1, b = 2;
//	max(a, b);
//
//	int c = 1;
//	// 逗号表达式，返回值是最后一个值
//	int m = (a, b);
//	if (a, b, c)
//	{
//		printf("进来:%d\n", m);
//	}
//
//	int arr[10];
//	arr[0];
//	max(a, b);  // ()函数调用操作符
//
//	return 0;
//}

// 类型重定义  （其实就是给类型取别名）
//typedef unsigned int u_int;
//typedef unsigned int u_int;
//typedef int INT;
//
//int main()
//{
//	unsigned int ui = 0;
//	u_int uj;
//
//	INT j = 0;
//
//	return 0;
//}

// 声明一下j是外部（在其他文件中定义）
extern int j;

// 声明一下，sub是外部的，在其他文件定义
extern void sub();

// static 修饰局部变量改变了他的生命周期-整个程序运行期间
// static 修饰全局变量改变是变量可见性(只在定义文件可以用)
// static 修饰函数改变是函数的可见性(只在定义文件可以用)
void add()
{
	static int i = 0;
	++i;
	printf("局部static i:%d\n ", i);

	//++j;
	//printf("全局 j:%d \n", j);
}

int main()
{
	add();
	add();
	add();

	//++i;
	//++j;

	sub();
	sub();


	return 0;
}
